In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\himanshu\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [35]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
df=pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [36]:
x=df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [37]:
type(x)

pandas.core.frame.DataFrame

In [39]:
df.iloc[3,2]

'Infrastructure'

In [11]:
z=df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [12]:
#Assignment
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df=pd.DataFrame(a)
df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [14]:
b=df[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [15]:
c=df[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [16]:
type(c)

pandas.core.frame.DataFrame

In [19]:
d=df['Student']
d

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [20]:
type(d)

pandas.core.series.Series

In [21]:
#.loc and .iloc
df.iloc[0, 0]

'David'

In [22]:
df.iloc[0,2]

'UK'

In [26]:
df.loc[0, 'Marks']

'85'

In [28]:
df2=df
df2=df2.set_index("Student")

In [29]:
df2

        Age Country            Course Marks
Student
David    27      UK            Python    85
Samuel   24  Canada   Data Structures    72
Terry    22   China  Machine Learning    89
Evan     32     USA   Web Development    76

In [30]:
df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [31]:
df2.head()

        Age Country            Course Marks
Student
David    27      UK            Python    85
Samuel   24  Canada   Data Structures    72
Terry    22   China  Machine Learning    89
Evan     32     USA   Web Development    76

In [40]:
df2.loc['Samuel', 'Course']

'Data Structures'

#Slicing

In [46]:
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [44]:
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [49]:
df.loc['Rose':'Jane', 'ID':'Department']

Empty DataFrame
Columns: [ID, Department]
Index: []

In [50]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

In [52]:
#Series
import pandas as pd
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [53]:
print(s[2])

30

In [54]:
print(s.iloc[3])

40

In [55]:
print(s[1:4])

1    20
2    30
3    40
dtype: int64

In [57]:
import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [58]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [63]:
print(df.iloc[2])
print('')
print(df.loc[3])

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

Name      David
Age          28
City    Chicago
Name: 3, dtype: object

In [65]:
print(df[['Name', 'Age']])
print('')
print(df[1:3])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [66]:
unique_dates = df['Age'].unique()
unique_dates

array([25, 30, 35, 28], dtype=int64)

In [67]:
%pip install xlrd openpyxl

Collecting xlrd
  Downloading xlrd-2.0.2-py2.py3-none-any.whl.metadata (3.5 kB)
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading xlrd-2.0.2-py2.py3-none-any.whl (96 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: xlrd, et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5 xlrd-2.0.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [71]:
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv'
df3 = pd.read_csv(csv_path)

In [72]:
df3.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [74]:
x = df3[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [75]:
x = df['Product']
x

0        Laptop
1    Smartphone
2    Desk Chair
3      Notebook
4       Monitor
Name: Product, dtype: object

In [76]:
print(type(x))

<class 'pandas.core.series.Series'>

In [80]:
y=df[['Product','Quantity','Price']]
y

      Product  Quantity  Price
0      Laptop         2    800
1  Smartphone         3    600
2  Desk Chair         5    150
3    Notebook        10      2
4     Monitor         1    300

In [81]:
df.iloc[0, 0]

1

In [85]:
df.iloc[1,0]

2

In [86]:
df.iloc[0,2]

'Electronics'

In [87]:
df.loc[0, 'Product']

'Laptop'

In [88]:
df.loc[0, 'Product']

'Laptop'

In [90]:
df.iloc[0:2, 0:3]

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics

In [91]:
df.loc[0:2, 'OrderID':'Category']

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics
2        3  Desk Chair    Furniture

In [92]:
#Quiz
#Use a variable q to store the column Price as a dataframe
q=df[['Price']]
q

   Price
0    800
1    600
2    150
3      2
4    300

In [93]:
#Assign the variable q to the dataframe that is made up of the column Product and Category:
q=df[['Product','Category']]
q

      Product     Category
0      Laptop  Electronics
1  Smartphone  Electronics
2  Desk Chair    Furniture
3    Notebook   Stationery
4     Monitor  Electronics

In [94]:
#Access the 2nd row and the 3rd column of df:
df.iloc[1,2]

'Electronics'

In [95]:
new_index=['a','b','c','d','e']
df_new=df
df_new.index=new_index
df_new

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
a,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
b,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
c,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
d,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
e,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [96]:
df_new.loc['a', 'CustomerCity']

'New York'

In [97]:
df_new.loc['a':'d', 'CustomerCity']

a       New York
b    Los Angeles
c        Chicago
d        Houston
Name: CustomerCity, dtype: object